In [1]:
# Python to MySQL connect

In [2]:
# pip install PyMySQL

In [1]:
import pymysql as py
print('Done')

Done

In [11]:
conn = py.connect(user = 'root',
            password = 'utkarsh2408',
            host = 'localhost',
            autocommit = True)

print('Connection Created Successfully!! ')

Connection Created Successfully!!

In [15]:
# Cursor

In [16]:
cur = conn.cursor()
print('Done')

Done

In [17]:
# create database using python

In [18]:
query = '''create database IITM_day5;'''


cur.execute(query)
print('Done')

Done

In [19]:
query = 'USE IITM_day5;'
cur.execute(query)
print('Done')

Done

In [20]:
query = '''create table student_details
(
SID int not null,
student_name varchar(50),
course varchar(50),
Address varchar(50),
Scholarship float
);'''

cur.execute(query)
print('done')

done

In [21]:
query = '''insert into student_details
values
(101,"Kartik Tiwari","BCA","Delhi Janakpuri",5000),
(102,"Ravi","MCA","South Delhi",5500);
'''

cur.execute(query)
print('done')

done

In [22]:
query = '''insert into student_details
values
(102,"Ansh kumar","BCA","UP",5600),
(103,"Mannmeet","MCA","Jamnapaar",7600);
'''

cur.execute(query)
print('done')

done

In [24]:
sid = int(input('Enter Roll No/SID:'))
name = input('Enter your Name:')
course = input('Enter your Course:')
address =  input('Enter your Address:')
scholarship = float(input('Enter your scholarship in RS:'))

q = f'''insert into student_details
values
({sid},"{name}","{course}","{address}",{scholarship});
'''

cur.execute(q)
print('done')

Enter Roll No/SID: 110
Enter your Name: Jassmeet
Enter your Course: BBA
Enter your Address: Delhi
Enter your scholarship in RS: 5400

done

In [25]:
n = 3
for i in range(n):
    sid = int(input('Enter Roll No/SID:'))
    name = input('Enter your Name:')
    course = input('Enter your Course:')
    address =  input('Enter your Address:')
    scholarship = float(input('Enter your scholarship in RS:'))
    
    q = f'''insert into student_details
    values
    ({sid},"{name}","{course}","{address}",{scholarship});
    '''
    
    cur.execute(q)
    print('Record Inserted Successfully!!')
print('done')

Enter Roll No/SID: 200
Enter your Name: Amit
Enter your Course: BBA
Enter your Address: Noida
Enter your scholarship in RS: 2300

Record Inserted Successfully!!

Enter Roll No/SID: 201
Enter your Name: Akul
Enter your Course: BCA
Enter your Address: Gurugram
Enter your scholarship in RS: 3400

Record Inserted Successfully!!

Enter Roll No/SID: 203
Enter your Name: Ram
Enter your Course: BCA
Enter your Address: Delhi
Enter your scholarship in RS: 4300

Record Inserted Successfully!!
done

In [37]:
query = '''select * from student_details;'''
cur.execute(query)

records = cur.fetchall()

all_columns = []
for i in cur.description:
    all_columns.append(i[0])

import pandas as pd
df = pd.DataFrame(records,columns=all_columns)
df

   SID   student_name course          Address  Scholarship
0  101  Kartik Tiwari    BCA  Delhi Janakpuri       5000.0
1  102           Ravi    MCA      South Delhi       5500.0
2  102     Ansh kumar    BCA               UP       5600.0
3  103       Mannmeet    MCA        Jamnapaar       7600.0
4  110       Jassmeet    BBA            Delhi       5400.0
5  200           Amit    BBA            Noida       2300.0
6  201           Akul    BCA         Gurugram       3400.0
7  203            Ram    BCA            Delhi       4300.0

In [38]:

def show_records(db,table):
    
    query = f'''select * from {db}.{table};'''
    cur.execute(query)
    
    records = cur.fetchall()
    
    all_columns = []
    for i in cur.description:
        all_columns.append(i[0])
    
    import pandas as pd
    df = pd.DataFrame(records,columns=all_columns)
    return df

In [39]:
show_records('IITM_day5','student_details')

   SID   student_name course          Address  Scholarship
0  101  Kartik Tiwari    BCA  Delhi Janakpuri       5000.0
1  102           Ravi    MCA      South Delhi       5500.0
2  102     Ansh kumar    BCA               UP       5600.0
3  103       Mannmeet    MCA        Jamnapaar       7600.0
4  110       Jassmeet    BBA            Delhi       5400.0
5  200           Amit    BBA            Noida       2300.0
6  201           Akul    BCA         Gurugram       3400.0
7  203            Ram    BCA            Delhi       4300.0

In [40]:
show_records('IITM_DB','samplesuperstore')

,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,Sub-Category,Sales,Quantity,Discount,Profit
0,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,261.9600,2,0.00,41.9136
1,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,731.9400,3,0.00,219.5820
2,Second Class,Corporate,United States,Los Angeles,California,90036,West,Office Supplies,Labels,14.6200,2,0.00,6.8714
3,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Furniture,Tables,957.5775,5,0.45,-383.0310
4,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Office Supplies,Storage,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,Second Class,Consumer,United States,Miami,Florida,33180,South,Furniture,Furnishings,25.2480,3,0.20,4.1028
9990,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Furniture,Furnishings,91.9600,2,0.00,15.6332
9991,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Technology,Phones,258.5760,2,0.20,19.3932
9992,Standard Class,Consumer,United States,Costa Mesa,California,92627,West,Office Supplies,Paper,29.6000,4,0.00,13.3200
9993,Second Class,Consumer,United States,Westminster,California,92683,West,Office Supplies,Appliances,243.1600,2,0.00,72.9480

In [41]:
conn.close()